app/views/actors/show.html.erb

<h4>Shows: </h4>
<% @actor.shows.each do |show|%>
---
SELECT "shows".* FROM "shows" INNER JOIN "characters" ON "shows"."id" = "characters"."show_id" WHERE "characters"."actor_id" = ?  [["actor_id", 10]]

<h4>Characters: </h4>
<% @actor.characters.each do |c|%>
---
SELECT "characters".* FROM "characters" WHERE "characters"."actor_id" = ?  [["actor_id", 10]]