app/controllers/actors_controller.rb

SELECT "actors".* FROM "actors" WHERE "actors"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
    def show
        @actor = Actor.find(params[:id])

SELECT "actors".* FROM "actors" WHERE "actors"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
    def edit
        @actor = Actor.find(params[:id])