app/controllers/characters_controller.rb

    def new
        @character = Character.new
        @shows = []
        @actors = []
        Show.all.each do |show|
            @shows << show.title
        end
        Actor.all.each do |actor|
---
SELECT "shows".* FROM "shows"
SELECT "actors".* FROM "actors"