app/controllers/shows_controller.rb

    def show
        @show = Show.find(params[:id])
---
SELECT "shows".* FROM "shows" WHERE "shows"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]