app/views/shows/show.html.erb

SELECT "actors".* FROM "actors" INNER JOIN "characters" ON "actors"."id" = "characters"."actor_id" WHERE "characters"."show_id" = ?  [["show_id", 4]]
---
<h4>Actors: </h4>
<% @show.actors.each do |actor|%>

SELECT "characters".* FROM "characters" WHERE "characters"."show_id" = ?  [["show_id", 4]]
---
<h4>Characters: </h4>
<% @show.characters.each do |c|%>